import 'package:flutter/material.dart';

class advicePage extends StatelessWidget {
  const advicePage({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return MyHomePage();
  }
}

class MyHomePage extends StatefulWidget {
  @override
  _MyHomePageState createState() => _MyHomePageState();
}

class _MyHomePageState extends State<MyHomePage> {
  int _counter = 0;
  final List<String> number = ["01", "02", "03"];
  final List<String> items = [
    "พันธุ์ข้าว",
    "เตรียมดิน",
    "การปลูก",
    "การกำจัดวัชพืช",
    "การใส่ปุ๋ย",
    "การจัดการน้ำ",
    "การเก็บเกี่ยว"
  ];
  //
  final List<String> image = [
    "assets/images/03.png", //https://shorturl.asia/2p6wL
    "assets/images/04.png",
    "assets/images/05.png", //https://shorturl.asia/z0DyC
    "assets/images/06.png", //https://shorturl.asia/Lls9F
    "assets/images/07.png", //https://shorturl.asia/P9ZKy
    "assets/images/08.png", //https://shorturl.asia/2Zi1O
    "assets/images/09.png"
  ];
  final List<String> describ = [
    "\nกข49 \nลำต้นมีความแข็งแรง จึงไม่มีปัญหาต้นล้มเมื่อเจอลมแรง ต้านทานต่อเพลี้ยกระโดดสีน้ำตาลชนิดใหม่ เหมาะสำหรับพื้นที่นาชลประทานเขตภาคเหนือตอนล่างและภาคกลาง\n"
        "\nกข53 \nเป็นข้าวไม่ไวต่อช่วงแสง มีอะมิโลสต่ำ คุณภาพการหุงต้มและรับประทานอ่อนนุ่มเป็นที่นิยมของประชาชนที่บริโภคข้าวเจ้าในภาคเหนือ ต้านทานต่อแมลงบั่วในเขตภาคเหนือตอนบน\n"
        "\nกข55 \nเกิดจากการผสมพันธุ์ 3 ทางระหว่างพันธุ์ กข23 กับพันธุ์เล็บนกปัตตานี และเมื่อได้สายพันธุ์ใหม่แล้ว นำมาผสมกับข้าวพันธุ์ชัยนาท 1 ที่ศูนย์วิจัยข้าวพัทลุงเป็นข้าวไม่ไวต่อช่วงแสงเหมาะสำหรับพื้นที่นาชลประทานภาคใต้ในเขตลุ่มน้ำปากพนังและลุ่มน้ำทะเลสาบสงขลา\n"
        "\nกข18 \nเป็นพันธุ์ที่ต้านทานต่อโรคใบไหม้ ข้าวพันธุ์นี้มีคุณภาพใกล้เคียงกับพันธุ์ กข6 เหมาะสำหรับพื้นที่นาน้ำฝนในเขตภาคตะวันออกเฉียงเหนือและภาคเหนือตอนบน\n"
        "\nกขผ3 \nให้ผลผลิตสูงถึง 1,415 กก.ต่อไร่ เหมาะสำหรับปลูกในพื้นที่นาเขตชลประทานภาคกลาง เป็นข้าวเจ้าลูกผสมไม่ไวต่อช่วงแสง\n"
        "\nข้าวเหนียวลืมผัว \nเป็นข้าวเหนียวที่มีเยื่อหุ้มเมล็ดข้าวกล้องสีดำ ไวต่อช่วงแสง เก็บเกี่ยวประมาณกลางเดือนตุลาคม ลักษณะทรงกอตั้ง ต้นแข็ง ไม่ล้มง่าย เมล็ดมีคุณค่าทางโภชนาการสูง โดยเฉพาะสารต้านอนุมูลอิสระรวม สารเหล่านี้ ได้แก่ แอนโทไซยานิน และแกมมาโอไรซานอล ข้าวกล้องเมื่อหุงสุก มีกลิ่นหอม ลักษณะสัมผัสเมื่อแรกเคี้ยวจะกรุบ หนึบ ภายในนุ่มเหนียว\n"
        "\nข้าวไรซ์เบอรี่ \nเกิดจากการผสมข้ามพันธุ์ระหว่างข้าวเจ้าหอมนิลกับข้าวขาวดอกมะลิ 105 ลักษณะเป็นข้าวเจ้าที่มีเยื่อหุ้มเมล็ดข้าวกล้องสีม่วงเข้ม ไม่ไวต่อช่วงแสง รูปร่างเมล็ดเรียวยาว ข้าวกล้องมีความนุ่ม ต้านทานต่อโรคไหม้ ไม่ต้านทานโรคหลาว คุณสมบัติเด่นทางด้านโภชนาการ คือ มีสารต้านอนุมูลอิสระสูง\n",
    "\nต้องเตรียมแปลงนาให้เรียบสม่ำเสมอ หากแปลงมีความลาดเอียงของพื้นที่ควรแบ่งแปลงออกให้แต่ละแปลงมีความสม่ำเสมอของพื้นที่ เพื่อให้สามารถจัดการน้ำได้ง่าย ถึงแม้จะมีค่าใช้จ่ายมากในช่วงแรก แต่ก็จะคุ้มทุนในปีถัดไป แปลงนาที่เตรียมดินดี ต้องไถลึก ปรับพื้นนาให้เรียบสม่ำเสมอ ส่งผลให้ข้าวงอกสม่ำเสมอ ลดปัญหาวัชพืชในแปลง และจัดการน้ำง่าย การเจริญเติบโตของต้นข้าวดีโดยเฉพาะรากทำให้สามารถหาอาหารและปุ๋ยที่ใส่ลงไปได้อย่างมีประสิทธิภาพ\n"
        "\nการเพาะปลูกข้าวต่อเนื่องตลอดโดยไม่พักนาอาจจะทำให้เกิดปัญหาเมล็ดวัชพืชสะสมในแปลงมาก ชาวนาอาจจะต้องมีการไถเตรียมดินเพื่อล่อให้วัชพืชขึ้น แล้วไถกลบเพื่อกำจัดวัชพืช ก่อนการเตรียมดินเพื่อเพาะปลูกจริง ซึ่งก็เป็นอีกวิธีการหนึ่งที่ช่วยลดปริมาณวัชพืชที่จะงอกขึ้นมาเจริญเติบโตแข่งขันกันต้นข้าวที่ปลูก และลดปริมาณการใช้สารควบคุมวัชพืชในการเพาะปลูกได้",
    "\nในแต่ละพื้นที่มีการเพาะปลูกข้าวแตกต่างกันไป ตามความเหมาะสมของสภาพพื้นที่ แรงงาน เครื่องจักรกล และทุน เช่น การปลูกข้าวไร่ในที่ลาดเชิงเขา การปลูกข้าวนาดำทั้งปักดำด้วยแรงงานคนหรือเครื่องจักรนาหว่านทั้งที่เป็นนาหว่านข้าวแห้งหรือนาหว่านน้ำตม การปลูกข้าวนาโยน การปลูกข้าวนาหยอดหรือนาโรย การปลูกข้าวแบบประณีต ซึ่งวิธีการปลูกข้าวที่เหมาะสมต่อการจัดการมากที่สุดคือการปลูกให้เป็นแนวและต้นข้าวในแปลงไม่แน่นเกินไป เพื่อให้สะดวกต่อการจัดการแปลง วัชพืช โรคและแมลง",
    "\nวัชพืช คือพืชอื่นนอกจากต้นข้าวที่ปลูกที่เจริญเติบโตในแปลงนาแก่งแย่งปัจจัยการเจริญเติบโตจากต้นข้าว เช่น หญ้า กก ข้าวเรื้อ และ ข้าววัชพืช การทำนาควรเน้นเป็นการป้องกัน โดยใช้เมล็ดพันธุ์ที่ไม่มีเมล็ดวัชพืชหรือข้าววัชพืชปน ไถเตรียมดินให้ดี ใช้สารควบคุมวัชพืชให้เหมาะสม ใช้เครื่องมือช่วยกำจัด และมีการจัดการระดับน้ำในแปลงช่วย หากในแปลงมีวัชพืชมาในฤดูกาลเพาะปลูกที่แล้ว อาจจะต้องมีการไถ่เพื่อล่อให้วัชพืชขึ้นมากก่อนแล้วไถกลบอีกครั้งก่อนเตรียมดินปกติ หรือการเปลี่ยนเป็นปลูกข้าวแบบนาดำ เพื่อให้จัดการวัชพืชได้ง่าย ส่วนการป้องกันกำจัดนั้นสามารถทำได้โดย การใช้สารกำจัดวัชพืชทั้งแบบเลือกหรือไม่เลือกทำลาย การใช้แรงงานคนถาก ถอน หรือ ตัด ใช้เครื่องจักรกลไถพรวนระหว่างร่อง",
    "\nต้นข้าวต้องการธาตุอาหารเพื่อใช้สำหรับการเจริญเติบโตและให้ผลผลิต ซึ่งธาตุอาหารที่มีอยู่ในดินมักไปไม่เพียงพอต่อความต้องการของพืช โดยเฉพาะไนโตรเจน ฟอสฟอรัส และโพแทสเซียม จึงจำเป็นต้องใส่เพิ่มเพื่อให้ต้นข้าวสามารถเจริญเติบโตได้ตามปกติ การใส่ปุ๋ยตามความต้องการของต้นข้าวจึงมีความจำเป็น หากใส่มากเกินความจำเป็น ย่อมเป็นการเพิ่มต้นทุนการผลิตโดยใช่เหตุ อีกทั้งยังทำให้ต้นข้าวหักล้มง่ายและอ่อนแอต่อการเข้าทำลายของโรคและแมลงได้ง่าย การใส่ปุ๋ยอาจมีการวิเคราะห์ดินเพื่อเลือกสูตรปุ๋ยที่เหมาะสมก่อน หรือมีการใช้ปุ๋ยอินทรีย์ร่วมและควรไถกลบฟางข้าวเพื่อให้ย่อยสลายเป็นปุ๋ย เพื่อเพิ่มความอุดมสมบูรณ์และปรับโครงสร้างของดินซึ่งจะทำให้การใส่ปุ๋ยครั้งต่อไปสามารถลดการใส่ปุ๋ยลง โดยอาจใส่ 2 - 3 ครั้งต่อการเพาะปลูกข้าว 1 ฤดู ซึ่งปุ๋ยเคมีที่ใช้สำหรับนาข้าวโดยทั่วไปมี 2 แบบคือปุ๋ยผสมที่ใส่รองพื้นหรือปุ๋ยครั้งแรก มี 2 สูตรคือ 16-20-0 และ 16-16-8 สำหรับใช้ในดินปลูกข้าวที่เป็นดินเหนียวและดินทรายตามลำดับและปุ๋ยแต่งหน้าคือปุ๋ยสูตร 46-0-0 โดยมีอัตราการให้ดังนี้ ครั้งที่ 1 ใส่ปุ๋ยหลังจากหว่าน 20 - 30 วัน หรือ หลังปักดำ 7 - 10 วัน ในอัตรา 20 - 30 กิโลกรัมต่อไร่ ส่วนปุ๋ยครั้งที่ 2 และ 3 นั้นใช้สูตร 46 - 0 - 0 อัตรา 5 - 15 กิโลกรัมต่อไร่ เมื่อข้าวอยู่ในระยะแตกกอเต็มที่และระยะสร้างรวงอ่อนตามลำดับ หากชาวนาจะใส่ปุ๋ยเพียง 2 ครั้งแนะนำให้ใส่ครั้งแรกและใส่ครั้งที่ 2 แต่งหน้าเมื่อข้าวสร้างรวงอ่อน\n"
        "\nการใส่ปุ๋ยอินทรีย์ก็สามารถใช้เกณฑ์เดียวกันได้โดยต้องคำนึงถึงความต้องการธาตุอาหารสำหรับการเจริญเติบโตให้เพียงพอ ซึ่งการให้ผลผลิตข้าว 1,000 กิโลกรัมนั้นข้าวต้องการธาตุไนโตรเจน ฟอสฟอรัส และโพแทสเซียมอย่างละ 20 5 และ 25 กิโลกรัมตามลำดับ โดยธาตุอาหารที่ต้นข้าวดูดไปใช้ส่วนหนึ่งจะติดไปกับเมล็ดที่เก็บเกี่ยวออกไป และมีส่วนที่เหลือในฟางข้าวเป็น 5.4 1.1 และ 14.5 กิโลกรัมของไนโตรเจน ฟอสฟอรัส และโพแทสเซียม ตามลำดับ",
    "\nการขังน้ำในแปลงระยะกล้าถึงแตกกอ เพื่อการเจริญเติบโตและควบคุมวัชพืช ช่วงต่อไปอาจจะไม่จำเป็นต้องขังน้ำในแปลง และก่อนการเก็บเกี่ยว 7 - 10 วันต้องมีการระบายน้ำออกจากแปลงเพื่อให้ต้นข้าวสุกแก่พร้อมกันและรถเกี่ยวข้าวสามารถลงปฏิบัติงานได้สะดวก\n"
        "\nนอกจากนี้ยังมีการทำนาแบบเปียกสลับแห้งซึ่งเป็นภูมิปัญญาชาวนาไทย ที่สามารถประหยัดการใช้น้ำจากการทำนาได้ถึงร้อยละ 20 - 40 จากการใช้น้ำปกติ ผลจากการจัดการน้ำแบบนี้ยังช่วยลดปัญหาการระบาดของโรคและแมลง นาไม่หล่ม ส่งผลให้สะดวกต่อการจัดการแปลงนา\n",
    "\nเก็บเกี่ยวระยะพลับพลึง คือระยะหลังจากดอกข้าวบาน 28 - 30 วัน ควรมีการระบายน้ำออกจากแปลงนาก่อนเก็บเกี่ยว 7 - 10 วันเพื่อกระตุ้นให้ข้าวสุกแก่พร้อมกันและสามารถลงปฏิบัติงานได้สะดวก โดยเฉพาะการใช้รถเกี่ยวนวดข้าวที่มีน้ำหนักของตัวรถมาก เมื่อเก็บเกี่ยวแล้วชาวนามักขายทันที หรือหากนำมาลดความชื้นก่อนก็จะได้ราคาเพิ่มขึ้น"
  ];

  void _incrementCounter() {
    setState(() {
      _counter++;
    });
  }

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text(
          "คำแนะนำการปลูกข้าว",
          style: TextStyle(
              color: Color(0xFF17352E),
              fontSize: 30.0,
              fontWeight: FontWeight.bold),
        ),
        centerTitle: true,
        elevation: 0,
        backgroundColor: Color(0xFFABD793),
        leading: IconButton(
          icon: Icon(Icons.ac_unit_sharp),
          onPressed: () {},
        ),
      ),
      body: ListView.builder(
        itemCount: items.length,
        itemBuilder: (context, index) {
          return Card(
            child: InkWell(
              splashColor: Colors.blue.withAlpha(30),
              onTap: () {
                debugPrint('Card tapped.');

                Navigator.push(
                  context,
                  MaterialPageRoute(
                      builder: (context) => SecondRoute(
                          todo: items[index],
                          describ: describ[index],
                          image: image[index])),
                );
              },
              child: Row(
                children: [
                  Expanded(
                    child: FittedBox(
                      fit: BoxFit.contain, // otherwise the logo will be tiny
                      child: Image.network(
                        image[index],
                        width: 2,
                        height: 1,
                        alignment: Alignment.centerLeft,
                      ),
                    ),
                  ),
                  Expanded(
                    child: Text(
                      items[index],
                      textAlign: TextAlign.center,
                    ),
                  ),
                ],
              ),
            ),
          );
        },
      ),
    );
  }
}

class SecondRoute extends StatelessWidget {
  SecondRoute(
      {Key? key,
      required this.todo,
      required this.describ,
      required this.image})
      : super(key: key);
  final String todo;
  final String describ;
  final String image;

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: Color(0xFFABD793),
        title: Text(
          todo,
          style: TextStyle(
              color: Color(0xFF17352E),
              fontSize: 30.0,
              fontWeight: FontWeight.bold),
        ),
      ),
      body: SingleChildScrollView(
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.start,
          mainAxisSize: MainAxisSize.min,
          children: <Widget>[
            Image.network(image),
            Text(todo),
            Text(describ),
          ],
        ),
      ),
    );
  }
}
